"""
4.	Написать программу «Банковский депозит». Она должна состоять из функции и ее вызова с аргументами.
Клиент банка делает депозит на определенный срок. В зависимости от суммы и срока вклада определяется
процентная ставка:
1000–10000 руб (6 месяцев — 5 % годовых, год — 6 % годовых, 2 года — 5 % годовых).
10000–100000 руб (6 месяцев — 6 % годовых, год — 7 % годовых, 2 года – 6.5 % годовых).
100000–1000000 руб (6 месяцев — 7 % годовых, год — 8 % годовых, 2 года — 7.5 % годовых).
Необходимо написать функцию, в которую будут передаваться параметры: сумма вклада и срок вклада. Каждый из
трех банковских продуктов должен быть представлен в виде словаря с ключами (begin_sum, end_sum, 6, 12, 24).
Ключам соответствуют значения начала и конца диапазона суммы вклада и значения процентной ставки для каждого срока.
В функции необходимо проверять принадлежность суммы вклада к одному из диапазонов и выполнять
расчет по нужной процентной ставке. Функция возвращает сумму вклада на конец срока.
"""


def interest(sum, period):
    initial = {
        'min': {
            'begin_sum': 1000,
            'end_sum': 10000,
            6: 0.05,
            12: 0.06,
            24: 0.055,
        },
        'med': {
            'begin_sum': 10001,
            'end_sum': 100000,
            6: 0.06,
            12: 0.07,
            24: 0.65,
        },
        'max': {
            'begin_sum': 100001,
            'end_sum': 1000000,
            6: 0.07,
            12: 0.08,
            24: 0.075,
        }
    }

    def calculation(sum, period, interest):
        for i in range(period):
            sum += sum * (interest / 12)
        return sum

    rate = ''
    if sum in range(initial['min']['begin_sum'], initial['min']['end_sum'] + 1):
        rate = 'min'
    elif sum in range(initial['med']['begin_sum'], initial['med']['end_sum'] + 1):
        rate = 'med'
    elif sum in range(initial['max']['begin_sum'], initial['max']['end_sum'] + 1):
        rate = 'max'

    return round(calculation(sum, period, initial[rate][period]), 2)


print(interest(1000000, 12))
